// com_sources.js
const lectureData = {
  title: "📚 مصادر ومراجع تحليل تقيم الشركات",
  isSources: true, // هذا العلم يخّبر الصفحة بأن هذا ملف مصادر وليس محاضرة عادية
  content: `
        <div class="box">
            <p>هذه هي ملفات PDF الخاصة بمحاضرات مادة تحليل وتقيم الشركات اضغط على أي مصدر لفتحه مباشرة.</p>
        </div>
    `,
  sources: [
    {
      order: 1,
      name: "المحاضرة الأولى: تحليل وتقيم الشركات",
      title: "المحاضرة الأولى: تحليل وتقيم الشركات",
      filePath: "pdfs/com/محاضرة اول تحليل شركات.pdf",
    },
    {
      order: 2,
      name: "المحاضرة الثانية:  الحوكمة",
      title: "المحاضرة الثانية:  الحوكمة",
      filePath: "pdfs/com/الحوكمة.pdf",
    },
    {
      order: 3,
      name: "المحاضرة الثالثة: مفهوم حكومة الشركات",
      title: "المحاضرة الثالثة: مفهوم حكومة الشركات",
      filePath: "pdfs/com/تابع الحوكمة.pdf",
    },
    {
      order: 4,
      name: "المحاضرة الرابعة: تابع حوكمة الشركات",
      title: "المحاضرة الرابعة: تابع حوكمة الشركات",
      filePath: "pdfs/com/تابع تابع الحوكمة.pdf",
    },
    {
      order: 5,
      name: "المحاضرة الخامسة: دور المعلومات المحاسبية ",
      title: "المحاضرة الخامسة: دور المعلومات المحاسبية",
      filePath: "pdfs/com/الفصل2.pdf",
    },
    {
      order: 6,
      name: "المحاضرة السادسة: قائمة الدخل الشامل ",
      title: " المحاضرة السادسة: قائمة الدخل الشامل ",
      filePath: "pdfs/com/تابع الفصل التاني.pdf",
    },
    {
      order: 7,
      name: "المحاضرة الثامنة:- التحليل المالي كأداة",
      title: "المحاضرة الثامنة:- التحليل المالي كأداة",
      filePath: "pdfs/com/محاضرات تحليل وتقييم الشركات  (08) .pdf",
    },
    {
      order: 8,
      name: "المحاضرة التاسعة : النسب والمؤشرات",
      title: "المحاضرة التاسعة : النسب والمؤشرات",
      filePath:
        "pdfs/com/09 المحاضرة التاسعة - النسب والمؤشرات المالية مختصرة 02-05-2025.pdf",
    },
    {
      order: 9,
      name: "المحاضرة الثامنة والتاسعة اهم المعلومات ",
      title: "المحاضرة الثامنة والتاسعة اهم المعلومات ",
      filePath: "pdfs/com/المحاضره الثامنة والتاسعة تحليل وتقييم الشركات.pdf",
    },

    {
      order: 10,
      name: "امتحان تحليل الشركات ",
      title: "امتحان تحليل الشركات",
      filePath: "pdfs/com/امتحان  تحليل وتقيم الشركات.pdf",
    },
    {
      order: 11,
      name: "أسئلة ",
      title: "أسئلة",
      filePath:
        "pdfs/com/هدية ليلة الجمعة مراجعة نهائية مقرر تحليل الشركات (صلي علي النبي).pdf",
    },
   
  ],
};

if (typeof module !== "undefined" && module.exports) {
  module.exports = lectureData;
}
